Revit 2026 API

# AnalyticalNodeData Methods

---

The AnalyticalNodeData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
|  | GetConnectionStatus | Returns the Connection Status for this Analytical Node. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

AnalyticalNodeData Class

Autodesk.Revit.DB.Structure Namespace